In [4]:
import pandas as pd
from pathlib import Path
import statistics
import matplotlib.pyplot as plt
import numpy as np
pd.plotting.register_matplotlib_converters()
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from datetime import timedelta
import plotly.express as px

In [ ]:
nums=[1,2,3,4,5,6,7,8,9,10]

In [6]:
s=90
u='jk'
z='tzz'

In [19]:
la=list(map(lambda x: x**x, nums))

In [20]:
la

[1, 4, 27, 256, 3125, 46656, 823543, 16777216, 387420489, 10000000000]

In [15]:
 k=lambda x: x*8

In [16]:
k(5)

40

In [48]:
def funct(x):
    for x in nums:
        print (x**x)

In [52]:
funct(nums)

1
4
27
256
3125
46656
823543
16777216
387420489
10000000000

In [56]:
num=tuple(range(11))
num

(0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [58]:
my_list=[n*n for n in nums]
my_list

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [1]:
my_list=[]
for letter in 'abcd':
    for n in range(4):
        for t in 'efgh':
            my_list.append((letter, n,t))
my_list

In [75]:
# A simple generator function
def my_gen():
    n = 1
    print('This is printed first')
    # Generator function contains yield statements
    yield  n

    n += 1
    print('This is printed second')
    yield n

    n += 1
    print('This is printed at last')
    yield n

In [76]:
print(list(my_gen()))

This is printed first
This is printed second
This is printed at last
[1, 2, 3]

In [77]:
# Using for loop
for item in my_gen():
    print(item)

This is printed first
1
This is printed second
2
This is printed at last
3

In [82]:
ok

[(2, 'come, now okay, here, ok')]

In [95]:
english_web_share = 0.539
print('Share of websites in English: {:.2f}'.format(english_web_share))

Share of websites in English: 0.54

In [89]:
chinese_speakers = 1107
print('Number of people who speak Chinese:', chinese_speakers, 'million')

Number of people who speak Chinese: 1107 million

In [96]:
#Yandex
#format()

english_web_share = 0.539
print('Share of websites in English: {:.2f}'.format(english_web_share)) 
print('Share of websites in English: {:.2%}'.format(english_web_share))

Share of websites in English: 0.54
Share of websites in English: 53.90%

In [97]:
chinese_speakers = 1107
print('Number of people who speak Chinese:{} million'.format(chinese_speakers))

Number of people who speak Chinese:1107 million

In [98]:
#loop

emojixpress = [2.26, 19.1, 25.6, 233, 15.2, 22.7, 64.6, 87.5, 6.81, 6]

print('EmojiXpress')
print('-----------')

for x in emojixpress:
    count = int(x * 1000000)
    print('{} messages'.format(count))

print('-----------')

EmojiXpress
-----------
2260000 messages
19100000 messages
25600000 messages
233000000 messages
15200000 messages
22700000 messages
64599999 messages
87500000 messages
6810000 messages
6000000 messages
-----------

In [99]:
#let's find the sum of the first three emojis in the Twitter, mil. column and then calculate the share of each emoji in this sum. 
#Then we'll print the shares as percentages to one decimal place and print the header along with the sum.

twitter = [87.3, 150, 0]
twitter_sum=sum(twitter)
print("Twitter emoji share:")
for x in twitter:
    count=x/twitter_sum
    print('{:.1%}'.format(count))
print()
print('Total emojis: {} million'.format(twitter_sum))

Twitter emoji share:
36.8%
63.2%
0.0%

Total emojis: 237.3 million

In [100]:
emojixpress = [2.26, 19.1, 25.6, 233.0, 15.2]

total = 0
total += emojixpress[0]

total += emojixpress[1]

total += emojixpress[2]

total += emojixpress[3]

total += emojixpress[4]


print('{:.2f}'.format(total))

295.16

In [101]:
#or
emojixpress = [2.26, 19.1, 25.6, 233.0, 15.2]
total=sum(emojixpress)
print('{:.2f}'.format(total))

295.16

In [102]:
#or
emojixpress = [2.26, 19.1, 25.6, 233.0, 15.2]
total=0
for x in emojixpress:
    total+=x
print('{:.2f}'.format(total))

295.16

In [ ]:
#Ways to Round Values in Pandas DataFrame column
df['DataFrame column'].round(decimals = number of decimal places needed)

In [ ]:
#Round columns up to two decimal or more
df.style.format({'Ratio': '{: .2f}', 'Emojixpress_mil': '{: .2f}', 'IG_mil': '{: .2f}', 'Twitter_mil': '{: .2f}'})

In [2]:
#Data types
#1. Series (one dimensional data-only rows)
#2. DataFrame (two dimensional data type-rows and columns)

#Using Dictionary to create a table
#here, the keys becomes the column while the values becomes the rows

people={'First_name': ['Edwin', 'Jennifer', 'Sandra'], 'Last_name': 
        ['Uzoefuna', 'Ikediashi', 'Ikediashi'], 'Email': ['euzoefuna@rocketmail.com', 'Jenniferikediashi@yahoo.com', 'Sandraikediashi@yahoo.com']}

In [3]:
type(people)

dict

In [6]:
#Convert the table to a datafram using pandas
import pandas as pd

In [7]:
df_people=pd.DataFrame(people)

In [8]:
#to set the number of columns and rows to display at default. this is useful in a big dataset
pd.set_option('display.max_columns', 3)
pd.set_option('display.max_rows', 3)

In [9]:
df_people

  First_name  Last_name                        Email
0      Edwin   Uzoefuna     euzoefuna@rocketmail.com
1   Jennifer  Ikediashi  Jenniferikediashi@yahoo.com
2     Sandra  Ikediashi    Sandraikediashi@yahoo.com

In [10]:
df_people[: 2]

  First_name  Last_name                        Email
0      Edwin   Uzoefuna     euzoefuna@rocketmail.com
1   Jennifer  Ikediashi  Jenniferikediashi@yahoo.com

In [11]:
df_people.Email

0       euzoefuna@rocketmail.com
1    Jenniferikediashi@yahoo.com
2      Sandraikediashi@yahoo.com
Name: Email, dtype: object

In [12]:
type(df_people.Email)

pandas.core.series.Series

In [13]:
type(df_people)

pandas.core.frame.DataFrame

In [17]:
print(df_people[: 2])

  First_name  Last_name                        Email
0      Edwin   Uzoefuna     euzoefuna@rocketmail.com
1   Jennifer  Ikediashi  Jenniferikediashi@yahoo.com

In [37]:
#to access two columns, use double square brackets
df_people[['Last_name', 'Email']]

   Last_name                        Email
0   Uzoefuna     euzoefuna@rocketmail.com
1  Ikediashi  Jenniferikediashi@yahoo.com
2  Ikediashi    Sandraikediashi@yahoo.com

In [38]:
#to see all columns, use df_people.columns
df_people.columns

##to access two columns, use double square brackets
df_people[['Last_name', 'Email']]

Index(['First_name', 'Last_name', 'Email'], dtype='object')

In [41]:
#to see some rows, use loc/iloc
#iloc accesses the rows and columns based on the integar values 
#loc accesses the rows based on the index value/label name and the column based on the column name
#example

df_people.iloc[0]

First_name                       Edwin
Last_name                     Uzoefuna
Email         euzoefuna@rocketmail.com
Name: 0, dtype: object

In [42]:
#to select two rows using iloc, use double square brackets

df_people.iloc[[0, 1]]

  First_name  Last_name                        Email
0      Edwin   Uzoefuna     euzoefuna@rocketmail.com
1   Jennifer  Ikediashi  Jenniferikediashi@yahoo.com

In [47]:
#to select rows and columns of a particular data using iloc
df_people.iloc[[0, 1], [0,2]]

  First_name                        Email
0      Edwin     euzoefuna@rocketmail.com
1   Jennifer  Jenniferikediashi@yahoo.com

In [56]:
#using loc
df_people.loc[[0,2], 'Email']

0     euzoefuna@rocketmail.com
2    Sandraikediashi@yahoo.com
Name: Email, dtype: object

In [57]:
df_people.loc[[0,2], ['Email','First_name']]

                       Email First_name
0   euzoefuna@rocketmail.com      Edwin
2  Sandraikediashi@yahoo.com     Sandra

In [ ]:
#slicing
#you can only slice using loc. using index numbers for rows and label/column name for column

In [70]:
df_people.loc[0:2]

  First_name  Last_name                        Email
0      Edwin   Uzoefuna     euzoefuna@rocketmail.com
1   Jennifer  Ikediashi  Jenniferikediashi@yahoo.com
2     Sandra  Ikediashi    Sandraikediashi@yahoo.com

In [83]:
df_people.loc[0:2, 'First_name':'Last_name']

  First_name  Last_name
0      Edwin   Uzoefuna
1   Jennifer  Ikediashi
2     Sandra  Ikediashi

In [98]:
#how to set, reset and use indices
#in this eg, lets set the email address as the index of this dataframe

df_people.set_index('Email', inplace=True)

In [99]:
df_people

                            First_name  Last_name
Email
euzoefuna@rocketmail.com         Edwin   Uzoefuna
Jenniferikediashi@yahoo.com   Jennifer  Ikediashi
Sandraikediashi@yahoo.com       Sandra  Ikediashi

In [100]:
#access a row now using loc

df_people.loc['Jenniferikediashi@yahoo.com']

First_name     Jennifer
Last_name     Ikediashi
Name: Jenniferikediashi@yahoo.com, dtype: object

In [101]:
#access a row and a column now using loc

df_people.loc['Jenniferikediashi@yahoo.com', 'First_name']

'Jennifer'

In [87]:
#reset the index to default by using reset_index() function

df_people.reset_index(inplace=True)

In [88]:
df_people

                         Email First_name  Last_name
0     euzoefuna@rocketmail.com      Edwin   Uzoefuna
1  Jenniferikediashi@yahoo.com   Jennifer  Ikediashi
2    Sandraikediashi@yahoo.com     Sandra  Ikediashi

In [ ]:
#set the index to a particular column while reading the csv dataset
df=pd.read_csv('C:/Users/euzoe/OneDrive/Desktop/DATA ANALYSIS/MY_PROJECTS/survey_results_public.csv', index_col='ResponseId')

In [102]:
#Filtering - Using Conditionals to Filter Rows and Columns

#filter out last names = ikediashi
df_people ['Last_name']=='Ikediashi'

Email
euzoefuna@rocketmail.com       False
Jenniferikediashi@yahoo.com     True
Sandraikediashi@yahoo.com       True
Name: Last_name, dtype: bool

In [115]:
filt=df_people ['Last_name']=='Ikediashi'

In [116]:
df_people[filt]

                            First_name  Last_name
Email
Jenniferikediashi@yahoo.com   Jennifer  Ikediashi
Sandraikediashi@yahoo.com       Sandra  Ikediashi

In [110]:
#or

df_people[df_people['Last_name']=='Ikediashi']

                            First_name  Last_name
Email
Jenniferikediashi@yahoo.com   Jennifer  Ikediashi
Sandraikediashi@yahoo.com       Sandra  Ikediashi

In [120]:
#or

df_people.loc[filt]

#using loc is prefered because you can still filter further. for eg, i'd like to filter only the first names of those with the last name selected

df_people.loc[filt, 'First_name']

Email
Jenniferikediashi@yahoo.com    Jennifer
Sandraikediashi@yahoo.com        Sandra
Name: First_name, dtype: object

In [124]:
# & and &or (|) operators to filter

# & operator

filt2=(df_people['Last_name']=='Ikediashi') & (df_people['First_name']=='Jennifer')

In [125]:
df_people.loc[filt2]

                            First_name  Last_name
Email
Jenniferikediashi@yahoo.com   Jennifer  Ikediashi

In [126]:
# (|) or operator

filt3=(df_people['Last_name']=='Ikediashi') | (df_people['First_name']=='Jennifer')

In [127]:
df_people.loc[filt3]

                            First_name  Last_name
Email
Jenniferikediashi@yahoo.com   Jennifer  Ikediashi
Sandraikediashi@yahoo.com       Sandra  Ikediashi

In [128]:
# using ~ will give other datas not specified in the filter condition above

df_people.loc[~filt3]

                         First_name Last_name
Email
euzoefuna@rocketmail.com      Edwin  Uzoefuna

In [133]:
#Updating Rows and Columns - Modifying Data Within DataFrames

#lets rename all the columns
df_people.columns=['specify all the columns new names']

In [ ]:
#change all column names to UPPER CASE
#using a list comprehension

df_people.columns[x.upper() for x in df_people.columns]

In [147]:
#to replace a space or _ in columns

df_people.columns=df_people.columns.str.replace('_', ' ')

In [148]:
df_people

  First name  Last name                        Email
0      Edwin   Uzoefuna     euzoefuna@rocketmail.com
1   Jennifer  Ikediashi  Jenniferikediashi@yahoo.com
2     Sandra  Ikediashi    Sandraikediashi@yahoo.com

In [149]:
df_people.columns=df_people.columns.str.replace(' ', '_')

In [150]:
df_people

  First_name  Last_name                        Email
0      Edwin   Uzoefuna     euzoefuna@rocketmail.com
1   Jennifer  Ikediashi  Jenniferikediashi@yahoo.com
2     Sandra  Ikediashi    Sandraikediashi@yahoo.com

In [ ]:
#plotting 

plotdata.reset_index().plot(
    x="column", y=["column 1", "column 2"], kind="bar")
plt.title("Mince Pie Consumption 18/19")
plt.xlabel("Family Member")
plt.ylabel("Pies Consumed")

In [ ]:
px.bar(data_frame = rela, x = 'Year_Construction', y = 'Rent')

In [ ]:
#Relationship between two columns

import seaborn as sns

sns.regplot(x=rela["column 1"], y=rela["column 2"])

In [2]:
#isin() function

df=df.loc[df.Months.isin(['January', 'February', 'March', 'April', 'May', 'June', 'July','August', 'September', 'October', 'November', 'December'])]
df

('test.csv', <http.client.HTTPMessage at 0x1e35362aa90>)

# How to Calculate Correlation in Python
-To calculate the correlation between two variables in Python, we can use the Numpy corrcoef() function.

In [18]:
import numpy as np

np.random.seed(100)

In [20]:
#calculate the correlation between two arrays
np.corrcoef(var1, var 2)

# To save a url file as a csv

In [ ]:
df.to_csv('~/Desktop/new file name.csv')

# or

df.to_csv('C:/Users/euzoe/OneDrive/Desktop/DATA ANALYSIS/nrw-data-analytics/name1.csv')

# Pie chart

In [ ]:
df.plot(kind='pie', y='Percentage', autopct='%1.1f%%', shadow=True,
                                title='Percentage of the apartments in high quality condition', legend=False)

# Plotting a Correlation matrix

In [ ]:
import seaborn as sns
import matplotlib.pyplot as plt
hm = sns.heatmap(df.corr(), annot = True)
hm.set(xlabel='Price', ylabel='Kms', title = "Correlation matrix of IRIS data\n")
plt.show()

# Pandas Filtering
# There are several ways to filter data from a dataframe in Pandas.

# 1. Boolean / Dataframe

In [ ]:
df[df['Year'] >= 2016]

In [ ]:
df[df.Year >= 2016]

In [ ]:
df[(df['Make'] == 'Ford') & (df['Year'] >= 2016)]

# 2. query()

In [ ]:
df.query('Make == "Ford"')

In [ ]:
df.query('Make == "Ford"& Year >=2016')

# 3. loc[]

In [ ]:
df.loc[df['Year'] >= 2016]

In [ ]:
df.loc[(df['Make'] == 'Ford')&(df['Year'] >=2016)]

# groupby()

In [ ]:
df.groupby('Make')[['Price']].mean()
df.groupby('Make')[['Price']].mean().round(1).sort_values('Price', ascending= False)

In [ ]:
# We can also add another column to the groups. For example, what is the average kms by each make?

df.groupby('Make')[['Price','Kms']].mean().round(1)

In [ ]:
cars.groupby('Make')[['Model']].nunique()

# Python get today's date

In [2]:
from datetime import date

today = date.today()
print("Today's date:", today)

Today's date: 2022-04-01

# Current date in different formats

Now, you can use the strftime() method to create a string representing date in different formats.

In [1]:
from datetime import date

today = date.today()

# dd/mm/YY
d1 = today.strftime("%d/%m/%Y")
print("d1 =", d1)

# Textual month, day and year	
d2 = today.strftime("%B %d, %Y")
print("d2 =", d2)

# mm/dd/y
d3 = today.strftime("%m/%d/%y")
print("d3 =", d3)

# Month abbreviation, day and year	
d4 = today.strftime("%b-%d-%Y")
print("d4 =", d4)

d1 = 01/04/2022
d2 = April 01, 2022
d3 = 04/01/22
d4 = Apr-01-2022

# Get the current date and time

In [3]:
from datetime import datetime

# datetime object containing current date and time
now = datetime.now()
 
print("now =", now)

# dd/mm/YY H:M:S
dt_string = now.strftime("%d/%m/%Y %H:%M:%S")
print("date and time =", dt_string)

now = 2022-04-01 19:55:18.812203
date and time = 01/04/2022 19:55:18

# Generate a random date added to pandas DataFrame

In [ ]:
import numpy as np
import pandas as pd

df["Fake_date"] = np.random.choice(pd.date_range('1980-01-01', '2000-01-01'), len(df))

Fill NaT with todays date

In [ ]:
fill = df.select_dtypes(include=['datetime'])
df[fill.columns] = fill.fillna(pd.to_datetime('today'))
df.head()

#or

fill = pd.to_datetime('2022-02-15')
df['posted_date'] = df['posted_date'].fillna(fill)

# check for the version of python you are using

In [ ]:
import sys

In [ ]:
sys.version

# Read a file in colab

In [ ]:
import io

In [ ]:
from google.colab import files
uploaded = files.upload()

In [ ]:
df = pd.read_csv(io.BytesIO(uploaded['AppleStore.csv']))
df

# Use column name as index 0

In [ ]:
df = pd.read_csv("https://raw.githubusercontent.com/juliandnl/redi_ss20/master/berlin_rental.csv", index_col= 'Region')

# Rename columns

In [ ]:
df.rename(columns = {'old_col1':'new_col1', 'old_col2':'new_col2'}, inplace = True)

In [3]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/juliandnl/redi_ss20/master/cars.csv")

In [4]:
df

,Make,Model,Year,Variant,Kms,Price,Doors,Kind,Location
0,Volkswagen,Vento,2012,2.5 Luxury 170cv,99950,360000,4.0,Sedn,Crdoba
1,Ford,Ranger,2012,2.3 Cd Xl Plus 4x2,140000,320000,2.0,Pick-Up,Entre Ros
2,Volkswagen,Fox,2011,1.6 Trendline,132000,209980,5.0,Hatchback,Bs.as. G.b.a. Sur
3,Ford,Ranger,2017,3.2 Cd Xls Tdci 200cv Automtica,13000,798000,4.0,Pick-Up,Neuqun
4,Volkswagen,Gol,2013,1.4 Power 83cv 3 p,107000,146000,3.0,Hatchback,Crdoba
...,...,...,...,...,...,...,...,...,...
9995,Ford,Focus III,2016,2.0 Se,67000,399000,5.0,Hatchback,Bs.as. G.b.a. Oeste
9996,Volkswagen,Bora,2012,1.9 Trendline I 100cv,120000,240000,4.0,Sedn,Buenos Aires Interior
9997,Ford,Fiesta Kinetic Design,2012,1.6 Design 120cv Titanium,89000,250000,5.0,Hatchback,Tucumn
9998,Ford,Fiesta Kinetic Design,2013,1.6 Design 120cv Titanium,76000,295000,5.0,Hatchback,Buenos Aires Interior
9999,Ford,Focus III,2014,2.0 Titanium At6,32000,380000,5.0,Hatchback,Bs.as. G.b.a. Sur

# TO SAVE A url file as a csv

In [12]:
df.to_csv('~/Desktop/cars.csv')